# Mengisi Data dan Buat Database soal_data

In [45]:
# buat tabel negara
'''
CREATE TABLE Negara (
    Kode_Negara CHAR(3) PRIMARY KEY,
    Negara VARCHAR(50) NOT NULL
);
'''
# mengisi tabel negara
'''
INSERT INTO Negara (Kode_Negara, Negara)
VALUES
('IDN', 'INDONESIA'),
('MYS', 'MALAYSIA'),
('THA', 'THAILAND');
'''

"\nINSERT INTO Negara (Kode_Negara, Negara)\nVALUES\n('IDN', 'INDONESIA'),\n('MYS', 'MALAYSIA'),\n('THA', 'THAILAND');\n"

In [46]:
# buat tabel produk
'''
CREATE TABLE Produk (
    HsCode VARCHAR(15) PRIMARY KEY,
    Label VARCHAR(100) NOT NULL
);
'''
# mengisi tabel produk
'''
INSERT INTO Produk (HsCode, Label)
VALUES
('301.11', 'IKAN AIR TAWAR'),
('0301.11.92', 'IKAN MAS KOKI'),
('302.36.00', 'TUNA SIRIP BIRU SELATAN'),
('901.11.20', 'ARABIKA'),
('902.1', 'TEH HIJAU'),
('902.3', 'TEH HITAM');
'''

"\nINSERT INTO Produk (HsCode, Label)\nVALUES\n('301.11', 'IKAN AIR TAWAR'),\n('0301.11.92', 'IKAN MAS KOKI'),\n('302.36.00', 'TUNA SIRIP BIRU SELATAN'),\n('901.11.20', 'ARABIKA'),\n('902.1', 'TEH HIJAU'),\n('902.3', 'TEH HITAM');\n"

In [47]:
# buat tabel perdagangan
'''
CREATE TABLE Perdagangan (
    ID_Trx VARCHAR(10) PRIMARY KEY,
    Kode_Negara CHAR(3) NOT NULL,
    HsCode VARCHAR(15) NOT NULL,
    Sektor VARCHAR(50),
    Bulan INT CHECK (Bulan BETWEEN 1 AND 12),
    Tahun INT CHECK (Tahun >= 1900 AND Tahun <= 2100),
    Nilai DECIMAL(15, 2),
    FOREIGN KEY (Kode_Negara) REFERENCES Negara(Kode_Negara),
    FOREIGN KEY (HsCode) REFERENCES Produk(HsCode)
);
'''
# mengisi tabel perdagangan
'''
INSERT INTO Perdagangan (ID_Trx, Kode_Negara, HsCode, Sektor, Bulan, Tahun, Nilai)
VALUES
('T001', 'IDN', '0301.11.92', 'PERIKANAN', 2, 2024, 1500),
('T002', 'IDN', '902.1', 'PERKEBUNAN', 2, 2024, 1100),
('T003', 'MYS', '301.11', 'PERIKANAN', 3, 2024, 900),
('T004', 'MYS', '302.36.00', 'PERIKANAN', 3, 2024, 1600),
('T005', 'THA', '902.3', 'PERKEBUNAN', 4, 2024, 1300),
('T006', 'THA', '902.1', 'PERKEBUNAN', 5, 2024, 1350),
('T007', 'IDN', '901.11.20', 'PERKEBUNAN', 5, 2024, 1250);
'''

"\nINSERT INTO Perdagangan (ID_Trx, Kode_Negara, HsCode, Sektor, Bulan, Tahun, Nilai)\nVALUES\n('T001', 'IDN', '0301.11.92', 'PERIKANAN', 2, 2024, 1500),\n('T002', 'IDN', '902.1', 'PERKEBUNAN', 2, 2024, 1100),\n('T003', 'MYS', '301.11', 'PERIKANAN', 3, 2024, 900),\n('T004', 'MYS', '302.36.00', 'PERIKANAN', 3, 2024, 1600),\n('T005', 'THA', '902.3', 'PERKEBUNAN', 4, 2024, 1300),\n('T006', 'THA', '902.1', 'PERKEBUNAN', 5, 2024, 1350),\n('T007', 'IDN', '901.11.20', 'PERKEBUNAN', 5, 2024, 1250);\n"

# Jawaban Soal

In [9]:
from sqlalchemy import create_engine
import pandas as pd

In [50]:
engine = create_engine('mysql+pymysql://her1god:376521@localhost/soal_data')

# engine diatas untuk mysql saya, secara kalau defaul username dan password nya root dan kosong

<h3>Soal No 1A</h3>

In [32]:
query = """
SELECT 
    p.Kode_Negara,
    n.Negara,
    p.HsCode,
    pr.Label,
    p.Sektor,
    p.Bulan,
    p.Tahun,
    p.Nilai
FROM 
    Perdagangan p
JOIN 
    Produk pr ON p.HsCode = pr.HsCode
JOIN 
    Negara n ON p.Kode_Negara = n.Kode_Negara;
"""

# query diatas untuk menampilkan semua tabel, atau juga dari maksud soal no 1A


# Membaca data ke dalam DataFrame
df = pd.read_sql(query, engine)

# Menampilkan DataFrame
tampil1A = df.head()
tampil1A

,Kode_Negara,Negara,HsCode,Label,Sektor,Bulan,Tahun,Nilai
0,IDN,INDONESIA,0301.11.92,IKAN MAS KOKI,PERIKANAN,2,2024,1500.0
1,IDN,INDONESIA,902.1,TEH HIJAU,PERKEBUNAN,2,2024,1100.0
2,IDN,INDONESIA,901.11.20,ARABIKA,PERKEBUNAN,5,2024,1250.0
3,MYS,MALAYSIA,301.11,IKAN AIR TAWAR,PERIKANAN,3,2024,900.0
4,MYS,MALAYSIA,302.36.00,TUNA SIRIP BIRU SELATAN,PERIKANAN,3,2024,1600.0

<h3>Soal No 1B</h3>

In [36]:
query = """
SELECT 
    p.Kode_Negara,
    n.Negara,
    GROUP_CONCAT(p.HsCode ORDER BY p.HsCode ASC SEPARATOR ', ') AS HsCode,
    GROUP_CONCAT(pr.Label ORDER BY pr.Label ASC SEPARATOR ', ') AS Label
FROM 
    Perdagangan p
JOIN 
    Produk pr ON p.HsCode = pr.HsCode
JOIN 
    Negara n ON p.Kode_Negara = n.Kode_Negara
GROUP BY 
    p.Kode_Negara, n.Negara;
"""

# query diatas untuk menampilkan maksud soal no 1B


# Membaca data ke dalam DataFrame
df = pd.read_sql(query, engine)

# Menampilkan DataFrame
tampil1B = df.head()
tampil1B

,Kode_Negara,Negara,HsCode,Label
0,IDN,INDONESIA,"0301.11.92, 901.11.20, 902.1","ARABIKA, IKAN MAS KOKI, TEH HIJAU"
1,MYS,MALAYSIA,"301.11, 302.36.00","IKAN AIR TAWAR, TUNA SIRIP BIRU SELATAN"
2,THA,THAILAND,"902.1, 902.3","TEH HIJAU, TEH HITAM"

<h3>Soal No 1C</h3>

In [44]:
query = """
SELECT 
    n.Negara AS Negara,
    p.HsCode,
    pr.Label,
    SUM(CASE WHEN p.Bulan = 1 THEN p.Nilai ELSE 0 END) AS Januari,
    SUM(CASE WHEN p.Bulan = 2 THEN p.Nilai ELSE 0 END) AS Februari,
    SUM(CASE WHEN p.Bulan = 3 THEN p.Nilai ELSE 0 END) AS Maret,
    SUM(CASE WHEN p.Bulan = 4 THEN p.Nilai ELSE 0 END) AS April,
    SUM(CASE WHEN p.Bulan = 5 THEN p.Nilai ELSE 0 END) AS Mei
FROM 
    Perdagangan p
JOIN 
    Produk pr ON p.HsCode = pr.HsCode
JOIN 
    Negara n ON p.Kode_Negara = n.Kode_Negara
GROUP BY 
    n.Negara, p.HsCode, pr.Label;
"""

# query diatas untuk menampilkan maksud soal no 1C


# Membaca data ke dalam DataFrame
df = pd.read_sql(query, engine)

# Menampilkan DataFrame
tampil1C = df.head()
tampil1C

,Negara,HsCode,Label,Januari,Februari,Maret,April,Mei
0,INDONESIA,0301.11.92,IKAN MAS KOKI,0.0,1500.0,0.0,0.0,0.0
1,INDONESIA,902.1,TEH HIJAU,0.0,1100.0,0.0,0.0,0.0
2,INDONESIA,901.11.20,ARABIKA,0.0,0.0,0.0,0.0,1250.0
3,MALAYSIA,301.11,IKAN AIR TAWAR,0.0,0.0,900.0,0.0,0.0
4,MALAYSIA,302.36.00,TUNA SIRIP BIRU SELATAN,0.0,0.0,1600.0,0.0,0.0

<h3>Soal No 1D</h3>

In [53]:
"""
untuk cara tuning/optimalisasi query ada beberapa opsi yang bisa digunakan. diantara lain adalah:
1. indexing
2. normalisasi/denormalisasi
3. penggunaan query yang efesien
4. melakukan kompresi dan partisi pada tabel
5. melakukan optimasi database dengan caching, dan batch processing

perlu diketahui juga, cara diatas merupakan metode yang bisa dilakukan sesuai kondisi.
jika sebuah data tersebut besar, maka perlu melakukan tuning/optimasi pada database kita. agar peforma pencarian data nya bisa lebih
efisien dan cepat. dan jika data tersebut masih relatif kecil dan tidak besar, maka metode diatas tidak perlu saja dilakukan.
karena akan memakan lebih waktu banyak untuk pengerjaan nya, dan relatif mahal juga untuk pengerjaan nya.

sumber : 
1. https://www.red-gate.com/simple-talk/databases/sql-server/performance-sql-server/the-sql-server-query-optimizer/
2. https://www.alibabacloud.com/blog/how-to-optimize-mysql-queries-for-speed-and-performance-on-alibaba-cloud-ecs_593872
3. https://dqlab.id/3-tipe-metode-pengolahan-data-yang-harus-kamu-ketahui
4. https://i-3.co.id/8-tips-optimasi-query-pada-oracle-database/
"""

'\nuntuk cara tuning/optimalisasi query ada beberapa opsi yang bisa digunakan. diantara lain adalah:\n1. indexing\n2. normalisasi/denormalisasi\n3. penggunaan query yang efesien\n4. melakukan kompresi dan partisi pada tabel\n5. melakukan optimasi database dengan caching, dan batch processing\n\nperlu diketahui juga, cara diatas merupakan metode yang bisa dilakukan sesuai kondisi.\njika sebuah data tersebut besar, maka perlu melakukan tuning/optimasi pada database kita. agar peforma pencarian data nya bisa lebih\nefisien dan cepat. dan jika data tersebut masih relatif kecil dan tidak besar, maka metode diatas tidak perlu saja dilakukan.\nkarena akan memakan lebih waktu banyak untuk pengerjaan nya, dan relatif mahal juga untuk pengerjaan nya.\n\nsumber : \n1. https://www.red-gate.com/simple-talk/databases/sql-server/performance-sql-server/the-sql-server-query-optimizer/\n2. https://www.alibabacloud.com/blog/how-to-optimize-mysql-queries-for-speed-and-performance-on-alibaba-cloud-ecs_593872\n3. https://dqlab.id/3-tipe-metode-pengolahan-data-yang-harus-kamu-ketahui\n4. https://i-3.co.id/8-tips-optimasi-query-pada-oracle-database/\n'

<h3>Soal No 1E</h3>